#### create dataframe

In [3]:
import pandas as pd 
data={"name":["javeed","rahul","kiran"],"No":[1,2,3]}
df=pd.DataFrame(data)
df

     name  No
0  javeed   1
1   rahul   2
2   kiran   3

#### handling null values

In [4]:
import pandas as pd
import numpy as np

data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', np.nan, 'David', 'Eve'],
    'Age': [25, np.nan, 30, 22, np.nan],
    'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston']
}

df = pd.DataFrame(data)
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

In [5]:
df.isnull()

      ID   Name    Age   City
0  False  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False   True
4  False  False   True  False

In [6]:
df.isnull().sum()

ID      0
Name    1
Age     2
City    1
dtype: int64

In [7]:
df.isnull().sum().sum()

4

In [8]:
import pandas as pd
import numpy as np

data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', np.nan, 'David', 'Eve'],
    'Age': [25, np.nan, 30, 22, np.nan],
    'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston']
}

df = pd.DataFrame(data)
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

#### filling with some particular value

In [9]:
df1=df.fillna(value=0)

In [10]:
df1

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   0.0  Los Angeles
2  103      0  30.0      Chicago
3  104  David  22.0            0
4  105    Eve   0.0      Houston

In [12]:
df1.isnull().sum()

ID      0
Name    0
Age     0
City    0
dtype: int64

#### filling with the previous value

In [19]:
df

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob   NaN  Los Angeles
2  103    NaN  30.0      Chicago
3  104  David  22.0          NaN
4  105    Eve   NaN      Houston

In [23]:
fill_previous=df.ffill()

In [24]:
fill_previous

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob  25.0  Los Angeles
2  103    Bob  30.0      Chicago
3  104  David  22.0      Chicago
4  105    Eve  22.0      Houston

In [26]:
back_fill=df.bfill()
back_fill

    ID   Name   Age         City
0  101  Alice  25.0     New York
1  102    Bob  30.0  Los Angeles
2  103  David  30.0      Chicago
3  104  David  22.0      Houston
4  105    Eve   NaN      Houston